{
  "battletris": "BATTLETRIS",
  "classes": {
    "ability-activator": "Key",
    "ability-costs": "Mana-Costs",
    "battletris": {
      "ability0": {
        "desc": "Repairs your armor a little bit.",
        "title": "Reparing Armor"
      },
      "ability1": {
        "desc": "Repairs your armor a little bit more.",
        "title": "Reparing Armor"
      },
      "ability2": {
        "desc": "Repairs your armor.",
        "title": "Reparing Armor"
      },
      "ability3": {
        "desc": "Repairs your armor massively.",
        "title": "Reparing Armor"
      },
      "ability4": {
        "desc": "Damages your armor a little bit.",
        "title": "Armor Damage"
      },
      "ability5": {
        "desc": "Damages your armor a little bit more.",
        "title": "Armor Damage"
      },
      "ability6": {
        "desc": "Damages your armor.",
        "title": "Armor Damage"
      },
      "ability7": {
        "desc": "Damages your armor massively.",
        "title": "Armor Damage"
      }
    },
    "cooldown": "Cooldown",
    "in-development": "This class is currently in development. Abilities for this class will be available soon...",
    "sorcerer": {
      "ability0": {
        "desc": "By applying a massive amount of gravity you cause the target's block to immediately drop.",
        "title": "Gravity Charge"
      },
      "ability1": {
        "desc": "Confuse the target by distorting the space around them, reversing their controls for 15 seconds.",
        "title": "Spatial Distortion"
      },
      "ability2": {
        "desc": "Speed up the target's block drop speed by amplifying the flow of time for 15 seconds.",
        "title": "Temporal Rift"
      },
      "ability3": {
        "desc": "By rending spacetime asunder you stop the target's time and freeze its controls solid for 10 seconds.",
        "title": "Spacetime Rupture"
      },
      "desc": "A powerful magician harnessing the power of space and time to defeat his foes.",
      "title": "The Sorcerer"
    },
    "unknown": {
      "ability0": {
        "desc": "Uses a simple shovel, that he found under a bridge, to remove a row at the bottom a Battlefield.",
        "title": "Shovel"
      },
      "ability1": {
        "desc": "In infinite boredom, the Unknown has optimized his skills with the Slingshot to shoot a whole series of stones at the bottom of a Battlefield.",
        "title": "Slingshot"
      },
      "ability2": {
        "desc": "The unknown has spent his time with a spinning top. The fast spins confuse opponents and they will spin their stones endless.",
        "title": "Spinning Top"
      },
      "ability3": {
        "desc": "The unknown is just so damn friendly and invites his target for a donut and fresh coffee.",
        "title": "Breakfast"
      },
      "desc": "A traveller from a distant land, looking for his destination. Has general abilities without a special orientation.",
      "title": "The unknown"
    },
    "warrior": {
      "ability0": {
        "desc": "Throw your current block at a target of your choice, replacing that target's block with yours.",
        "title": "Block throw"
      },
      "ability1": {
        "desc": "Throw all your weight (it's a lot!) into a punch, crushing a random 2x2 square on the board.",
        "title": "Punch"
      },
      "ability2": {
        "desc": "Fiercely stomp on the ground causing blocks with gaps beneath to drop.",
        "title": "Earthquake"
      },
      "ability3": {
        "desc": "Execute a full power slash with your beloved sword, cutting a diagonal line on your target's board.",
        "title": "Mighty Slash"
      },
      "desc": "An offensive fighter who attacks the enemy with direct attacks and his powerful muscle power. Harnesses abilities to hurt others and trigger entire earthquakes.",
      "title": "Warrior"
    }
  },
  "dashboard": {
    "abilities": {
      "desc": "At the beginning, each player selects a class that grants him special abilities like \"Add line\" or \"Remove line\". During the battles an ability can be activated on the target user with the \"q, w, e, r\". At first, each player is targeting his self. With the number keys 1 - 6 the enemy target can be switched to the specific user or use \"tab\" to select the next player. By pressing the tab key longer than 1 second, you will target directly yourself. Each ability requires mana to be activated, which you get by dissolving rows. The more rows you dissolve at once, the more mana you will receive.",
      "title": "Abilities"
    },
    "battle-control": {
      "desc": "Once you have joined a Battlefield, you can see the battle controls on the left and the overview of the different players on the right. If a battle is already running, you can simply watch the action. As soon as no battle has started and there is still free space available, you can join the battle at the bottom of the Battle Controls. After you are joined and ready, use the \"Start Battle\" button to start the battle. As soon as all joined Warriors have started the battle, start a 10 second timer after the actual game starts.",
      "title": "Battle Control"
    },
    "desc": "Welcome to Battletris, a multiplayer block stacking game for up to 7 players. You are currently in the tavern, a place where everyone can hang around to search for opponents. Checkup the Battlefields and join a match.",
    "how-to-play": {
      "desc": "I hope everyone knows the game principle of good old Tetris. The goal is to stack the opponent's Battlefield with blocks up to the top, so that the opponent is eliminated from the battle. The last player with free spaces wins the battle. <br>With the arrow keys (<i class=\"mdi mdi-arrow-left\"></i>, <i class=\"mdi mdi-arrow-right\"></i>) the active block can be changed to the right and to the left. The arrow up key (<i class=\"mdi mdi-arrow-up\"></i>) rotates the active tile. With the arrow down key (<i class=\"mdi mdi-arrow-down\"></i>) you can move the block down faster. <br>By pressing the space bar the active block is docked directly to the existing Battlefield, so you save a lot of time.",
      "title": "How to play"
    },
    "targets": {
      "desc": "Besides to the abilities their is one more game mechanic. As soon as you resolve rows, the armor of the target will be damaged. If the armor is fully locked down, a row will be attached to the bottom of the targets Battlefield. By targeting yourself and resolving rows, your armor will be regerenrated, so you can block heavy attacks. By resolving more than one row at the same time, this effect will be event stronger!",
      "title": "Targets"
    },
    "tavern": {
      "desc": "In the beginning you will find yourself in the \"Tavern\", a kind of lobby where players can find each other and join different battles. Once you have decided on a Battlefield, you can join it with the small icon (<i class=\"mdi mdi-login-variant\"></i>) in the upper right corner.",
      "title": "Tavern"
    },
    "title": "Whats Battletris?"
  },
  "room": {
    "join": "Join Battlefield",
    "joined": "Users joined"
  },
  "user-id-handling": {
    "title": "User export / import",
    "desc": "No match history available? Play a match or login with a exported battletris id.<br><br>Battletris wants to be a secure place for you and don't want to get any security information from you. So no <strong>PASSWORD</strong>, just a passwordless authentication. If you want to use the same user id on a different pc, please export a battletris user file and import it on the other machine.",
    "import": "Import user file",
    "export": "Export user file",
    "import-invalid": "Not a battletris user id file."
  },
  "history": {
    "title": "Match History"
  },
  "lobby": {
    "title": "Lobby",
    "chat-message": "Chat message",
    "send": "Send"
  },
  "game": {
    "running": "Game is running"
  },
  "coming-soon": "Coming soon..."
}